app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    @cart = session[:cart]
    @cart.items.each do |i|
      order_item = OrderItem.new
      order_item.product = i.product
      order_item.quantity = i.quantity
      order_item.save
---
INSERT INTO "order_items" ("product_id", "quantity", "order_id") VALUES(1310, 2.0, NULL)
INSERT INTO "orders" ("name", "created_at", "cart_items", "updated_at", "phone", "e_mail") VALUES('Прохор Шучалов', '2010-04-14 21:56:15', NULL, '2010-04-14 21:56:15', '+79194459575', 'p@shuchalov.ru')