app/controllers/photos_controller.rb

SELECT * FROM "photos" WHERE ("photos"."id" = 85)
---
  def get
    @img = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 74)
---
  def get_thumb
    @img = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 76)
---
  def add_tag
    tag = params[:tag]
    id = params[:id]
    photo = Photo.find(id)

SELECT * FROM "photos" WHERE ("photos"."id" = 82)
---
  def remove_tag
    tag = params[:tag]
    id = params[:id]
    photo = Photo.find(id)

SELECT "tags".* FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id WHERE (("taggings".taggable_id = 81) AND ("taggings".taggable_type = 'Photo'))
---
  def filter
    offset = params[:offset]
    offset ||= 0
    tag_list = params[:tag_list]
    if tag_list
      @files = Photo.find_tagged_with(tag_list, :match_all => true)

SELECT * FROM "products" WHERE ("products"."id" = 1314)
---
  def select
    @product = Product.find(params[:id])