app/controllers/store_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def category
    begin
      @category = Category.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1315)
---
  def product
    begin
      @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1314)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1085)
---
  def product_card
    @product = Product.find(params[:id])